app/Models/AnggotaModel.php

SELECT *
FROM `anggota`
---
    public function getAnggota($idanggota = false)
    {
        if ($idanggota == false) {
            return $this->findAll();